print("25. Написать программу преобразования десятичного числа в двоичное")

print(
    bin(
        int(
            input()
    )))