print("21. Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.")
"""Примеры
список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
список: [], ищем: "123", ответ: -1"""

source = ['4no', 'A3s', '5vj', '4no', '5vj', 'x4n']

def positions (source, elem):
    pos = [i for i in range(len(source)) if source[i] == elem]
    return pos

poss = positions(source, 'x4n')
if len(poss) >=2: print(poss[1])
else: print(-1)

